-- MySQL dump 10.10
--
-- Host: localhost    Database: studentdb
-- ------------------------------------------------------
-- Server version	5.0.22-community-nt



--
-- Table structure for table `class`
--

DROP TABLE IF EXISTS `class`;
CREATE TABLE `class` (
  `id` int(11) NOT NULL auto_increment,
  `classid` varchar(11) default NULL,
  `classname` varchar(255) default NULL,
  `classexplain` varchar(255) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `class`
--



LOCK TABLES `class` WRITE;
INSERT INTO `class` VALUES (1,'10001','计算机应用技术','信息工程学院'),(2,'10002','计算机网络技术','信息工程学院'),(3,'10003','信息安全与管理','信息工程学院'),(4,'10004','物联网应用技术','信息工程学院'),(6,'10006','软件与信息服务','信息工程学院'),(7,'10007','机电一体化技术','机电与自动化学院'),(8,'10008','工业机器人技术','机电与自动化学院'),(9,'10009','电气自动化技术','机电与自动化学院'),(10,'10010','汽车检测与维修技术','机电与自动化学院'),(11,'10011','建筑工程技术','建筑与艺术学院'),(12,'10012','工程造价','建筑与艺术学院'),(13,'10013','建筑室内设计','建筑与艺术学院'),(14,'10014','环境艺术设计','建筑与艺术学院'),(15,'10015','室内艺术设计','建筑与艺术学院'),(16,'10016','电子商务','经济与管理学院'),(17,'10017','会展策划与管理','经济与管理学院'),(18,'10018','工商企业管理','经济与管理学院'),(19,'10019','物流管理','经济与管理学院'),(20,'10020','国际贸易实务','经济与管理学院'),(21,'10021','会计','经济与管理学院'),(22,'10022','财务管理','经济与管理学院'),(23,'10023','互联网金融','经济与管理学院'),(24,'10024','商务英语','经济与管理学院'),(25,NULL,NULL,NULL),(26,NULL,NULL,NULL),(27,NULL,NULL,NULL),(28,NULL,NULL,NULL);
UNLOCK TABLES;


--
-- Table structure for table `score`
--

DROP TABLE IF EXISTS `score`;
CREATE TABLE `score` (
  `id` int(11) NOT NULL auto_increment,
  `studentid` varchar(11) default NULL,
  `studentname` varchar(255) default NULL,
  `studentscore` varchar(255) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `score`
--



LOCK TABLES `score` WRITE;
INSERT INTO `score` VALUES (1,'1701132001','鸿蒙','100');
UNLOCK TABLES;


--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `id` int(11) NOT NULL auto_increment,
  `sid` int(11) default NULL,
  `name` varchar(255) default NULL,
  `sex` varchar(255) default NULL,
  `age` datetime default NULL,
  `tel` varchar(255) default NULL,
  `grade` varchar(255) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `student`
--



LOCK TABLES `student` WRITE;
INSERT INTO `student` VALUES (1,1710001,'鲲鹏','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(2,1710002,'独角兽','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(3,1710003,'混沌','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(4,1710004,'飞廉','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(5,1710006,'夔牛','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(6,1710006,'鬼车','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(7,1710007,'重明鸟','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(8,1710008,'化蛇','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(9,1710009,'祸斗','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(10,1710010,'蚣蝮','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(11,1710011,'钟山神','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(12,1710012,'虚耗','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(13,1710013,'貔貅','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(14,1710014,'螭吻','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(15,1710015,'霸下','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(16,1710016,'相柳氏','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(17,1710017,'蒲牢','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(18,1710018,'狻猊','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(19,1710019,'青龙','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(20,1710020,'白虎','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(21,1710021,'朱雀','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(22,1710022,'玄武','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(23,1710023,'嘲风','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(24,1710024,'睚毗','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(25,1710025,'囚牛','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(26,1710026,'风生兽','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(27,1710027,'何罗鱼','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(28,1710028,'蟠龙','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(29,1710029,'蛟龙','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(30,1710030,'螭龙','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(31,1710031,'应龙','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(32,1710032,'白矖','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(33,1710033,'麒麟','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(34,1710034,'白泽','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(35,1710035,'梼杌','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(36,1710036,'西王母','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(37,1710037,'冉遗鱼','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(38,1710038,'精卫','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(39,1710039,'狸力','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(40,1710040,'帝江','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(41,1710041,'举父','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(42,1710042,'獓狠','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(43,1710043,'饕餮','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(44,1710046,'九尾狐','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(45,1710045,'鳐鱼','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(46,1710046,'魍魉','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(47,1710047,'灭蒙鸟','女','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(48,1710048,'陵鱼','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(49,1710049,'比翼鸟','男','2019-06-20 00:00:00','1234567','广东省广州市天河区'),(50,1710050,'蚩尤','男','2019-06-22 00:00:00','1234567','广东省广州市天河区'),(53,1710060,'张三','男','1997-04-27 00:00:00','12345','广东省广州市天河区');
UNLOCK TABLES;


--
-- Table structure for table `useroa`
--

DROP TABLE IF EXISTS `useroa`;
CREATE TABLE `useroa` (
  `Id` int(11) NOT NULL auto_increment,
  `username` varchar(255) default NULL,
  `name` varchar(255) default NULL,
  `password` varchar(255) default NULL,
  `phone` varchar(255) default NULL,
  PRIMARY KEY  (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `useroa`
--



LOCK TABLES `useroa` WRITE;
INSERT INTO `useroa` VALUES (1,'admin','系统管理员','123456','1234567');
UNLOCK TABLES;


